# 1 "c:\\iot\\arduino2\\buzzer01\\app.ino"
# 10 "c:\\iot\\arduino2\\buzzer01\\app.ino"
int melody[49] = { // ∞ı ºº∏∂∏Æ
    262 /* 4ø¡≈∏∫Í µµ*/, 262 /* 4ø¡≈∏∫Í µµ*/, 262 /* 4ø¡≈∏∫Í µµ*/, 262 /* 4ø¡≈∏∫Í µµ*/, 262 /* 4ø¡≈∏∫Í µµ*/, // µµµµµµµµµµ
    330 /* 4ø¡≈∏∫Í πÃ*/, 392 /* 4ø¡≈∏∫Í º÷*/, 392 /* 4ø¡≈∏∫Í º÷*/, 330 /* 4ø¡≈∏∫Í πÃ*/, 262 /* 4ø¡≈∏∫Í µµ*/, // πÃº÷º÷πÃµµ
    392 /* 4ø¡≈∏∫Í º÷*/, 392 /* 4ø¡≈∏∫Í º÷*/, 330 /* 4ø¡≈∏∫Í πÃ*/, 392 /* 4ø¡≈∏∫Í º÷*/, 392 /* 4ø¡≈∏∫Í º÷*/, 330 /* 4ø¡≈∏∫Í πÃ*/, // º÷º÷πÃº÷º÷πÃ
    262 /* 4ø¡≈∏∫Í µµ*/, 262 /* 4ø¡≈∏∫Í µµ*/, 262 /* 4ø¡≈∏∫Í µµ*/, // µµµµµµ
    392 /* 4ø¡≈∏∫Í º÷*/, 392 /* 4ø¡≈∏∫Í º÷*/, 330 /* 4ø¡≈∏∫Í πÃ*/, 262 /* 4ø¡≈∏∫Í µµ*/, // º÷º÷πÃµµ
    392 /* 4ø¡≈∏∫Í º÷*/, 392 /* 4ø¡≈∏∫Í º÷*/, 392 /* 4ø¡≈∏∫Í º÷*/, // º÷º÷º÷
    392 /* 4ø¡≈∏∫Í º÷*/, 392 /* 4ø¡≈∏∫Í º÷*/, 330 /* 4ø¡≈∏∫Í πÃ*/, 262 /* 4ø¡≈∏∫Í µµ*/, // º÷º÷πÃµµ
    392 /* 4ø¡≈∏∫Í º÷*/, 392 /* 4ø¡≈∏∫Í º÷*/, 392 /* 4ø¡≈∏∫Í º÷*/,
    392 /* 4ø¡≈∏∫Í º÷*/, 392 /* 4ø¡≈∏∫Í º÷*/, 330 /* 4ø¡≈∏∫Í πÃ*/, 262 /* 4ø¡≈∏∫Í µµ*/, // º÷º÷πÃµµ
    392 /* 4ø¡≈∏∫Í º÷*/, 392 /* 4ø¡≈∏∫Í º÷*/, 392 /* 4ø¡≈∏∫Í º÷*/, 440 /* 4ø¡≈∏∫Í ∂Û*/, 392 /* 4ø¡≈∏∫Í º÷*/, // º÷º÷º÷∂Ûº÷
    523 /* 5ø¡≈∏∫Í ∑π*/, 392 /* 4ø¡≈∏∫Í º÷*/, 523 /* 5ø¡≈∏∫Í ∑π*/, 392 /* 4ø¡≈∏∫Í º÷*/, // µµº÷µµº÷
    330 /* 4ø¡≈∏∫Í πÃ*/, 294 /* 4ø¡≈∏∫Í ∑π*/, 262 /* 4ø¡≈∏∫Í µµ*/ // πÃ∑πµµ
};

// ¿Ω«• ±Ê¿Ã
int noteDuration[49] ={
    4, 8, 8, 4, 4, 4, 8, 8, 4, 4, 8, 8, 4, 8, 8, 4, 4, 4, 2,
    4, 4, 4, 4, 4, 4, 2, 4, 4, 4, 4, 4, 4, 2,
    4, 4, 4, 4, 8, 8, 8, 8, 2, 4, 4, 4, 4, 4, 4, 2
};


const int speaker_pin = 9;

void setup()
{
    pinMode(speaker_pin, 0x1);
}

void loop(){
    int m, d, dd;

    for(m=0; m<49; m++){
        d = 1000 / noteDuration[m];
        dd = d*1.3; //¿Ω √‚∑¬ Ω√∞£(4∫– ¿Ω«• 325ms)

        tone(speaker_pin, melody[m], d);
        delay(dd);
    }
    delay(1000);
}
